2019-session/lectures/rails/instacartlite/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "shoppers-watchers@instacart.com"], ["first_name", "Shoppers"], ["last_name", "Watchers"], ["created_at", "2020-01-21 06:35:34.245446"], ["updated_at", "2020-01-21 06:35:34.245446"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["first_name", "Shoppers2"], ["updated_at", "2020-01-21 06:35:41.897935"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)